Repository: inti-ar/bluetooth_controller
Catalog: lib/l10n/intl_*.arb
Languages: es

# title
source: INTI Bluetooth Controller
es: Botonera Bluetooth

# bleStatusReady
source: Bluetooth is up and running
es: Bluetooth habilitado y funcionando

# bleStatusLocationDisabled
source: Enable location services
es: Habilitá los servicios de ubicación para poder conectar el Bluetooth con otros dispositivos

# bleStatusPoweredOff
source: Bluetooth is powered off on your device turn it on
es: El Bluetooth está deshabilitado en tu dispositivo

# bleStatusUnauthorized
source: Authorize the INTI Bluetooth Controller app to use Bluetooth and location
es: Autorizá la aplicación para utilizar Bluetooth y la ubicación

# bleStatusUnsupported
source: This device does not support Bluetooth
es: Este dispositivo no soporta Bluetooth

# bleStatusDefault
source: Waiting to fetch Bluetooth status {status}
es: Esperando para obtener el estado {status}

# bleTurnOnBluetooth
source: Turn on Bluetooth
es: Activá Bluetooth

# deviceListTitle
source: Scan for devices
es: Escáner de dispositivos

# deviceListSearchServiceUUID
source: Service UUID:
es: UUID del servicio:

# deviceListInvalidUUID
source: Invalid UUID format
es: Formato de UUID inválido

# deviceListScan
source: Scan
es: Escanear

# deviceListStop
source: Stop
es: Parar

# deviceListTapToScan
source: Enter a UUID above and start to scan
es: Ingresá un UUID arriba y comenzá a escanear

# deviceListTapToConnect
source: Tap a device to connect to it
es: Seleccioná un dispositivo para conectar

# deviceListDiscoveredDevicesCount
source: count: {count}
es: cantidad: {count}

# chatOwnMessageSender
source: Me
es: Yo

# chatDeviceMessageSender
source: Device
es: Dispositivo

# chatConnectionStatus
source: Status: {connectionStatus}
es: Estado: {connectionStatus}

# chatConnect
source: Connect
es: Conectar

# chatDisconnect
source: Disconnect
es: Desconectar

# chatDiscoverServices
source: Discover Services
es: Encontrar servicios

# chatServiceSelectorHint
source: Service UUID
es: UUID del servicio

# chatReadCharacteristicSelectorHint
source: Read Characteristic UUID
es: UUID de característica de lectura

# chatWriteCharacteristicSelectorHint
source: Write Characteristic UUID
es: UUID de característica de escritura

# chatBackButtonText
source: Back
es: Volver
